{
  "ax": {
    "dataset": "ax_to_grind",
    "rows_in": 10069,
    "rows_out": 10069,
    "pct_modified": 30.80742874168239,
    "dropped_empty_after_cleaning": 0,
    "unique_chars_before": 152,
    "unique_chars_after": 144,
    "len_stats_before": {
      "min": 30,
      "median": 147.0,
      "p95": 1773.0,
      "max": 5224
    },
    "len_stats_after": {
      "min": 30,
      "median": 144.0,
      "p95": 1773.0,
      "max": 5222
    },
    "examples_before_after": [
      {
        "before": " CPEC  کے بارے میں خطرناک افواہیں",
        "after": "CPEC کے بارے میں خطرناک افواہیں"
      },
      {
        "before": " پرواز کا بھکاری پاکستانی نہیں ہے۔",
        "after": "پرواز کا بھکاری پاکستانی نہیں ہے۔"
      },
      {
        "before": "ایم بی ایس منظر سے غائب کیوں ہے اور کہاں ہے؟ ",
        "after": "ایم بی ایس منظر سے غائب کیوں ہے اور کہاں ہے؟"
      },
      {
        "before": "پی آئی اے کے پائلٹ نے اپنے بارے میں من گھڑت خبر ",
        "after": "پی آئی اے کے پائلٹ نے اپنے بارے میں من گھڑت خبر"
      },
      {
        "before": "نووا کاخووکا ڈیم کی خلاف ورزی: ​​پرانی تصویر آج کے نقصان کو غلط طور پر بیان کرنے کے لیے دوبارہ سامنے آئی",
        "after": "نووا کاخووکا ڈیم کی خلاف ورزی: پرانی تصویر آج کے نقصان کو غلط طور پر بیان کرنے کے لیے دوبارہ سامنے آئی"
      },
      {
        "before": "ہندوستانی فوج نےپی او کے میں پن پوائنٹ ہڑتالیں کیں ",
        "after": "ہندوستانی فوج نےپی او کے میں پن پوائنٹ ہڑتالیں کیں"
      },
      {
        "before": " سوشل میڈیا پر ایک وائرل ہو رہی ہے جس میں ایک شخص کو بےحد بڑی اسٹرا بیری کو پکڑے ہوئے دیکھا جا سکتا ہے۔ تصویر کو شیئر کرتے ہوئےصارفین کر رہےہیں کہ یہ تصویر دنیا کی سب سے بڑی اسٹرابیری کی ہے۔ وشواس نیوز نے اپنی پڑتال میں پایا کہ وائرل کی جا رہی تصویر کو آرٹیفیشئل انٹیلیجنس کی تکنیک کی تیار کیا گیا ہ",
        "after": "سوشل میڈیا پر ایک وائرل ہو رہی ہے جس میں ایک شخص کو بےحد بڑی اسٹرا بیری کو پکڑے ہوئے دیکھا جا سکتا ہے۔ تصویر کو شیئر کرتے ہوئےصارفین کر رہےہیں کہ یہ تصویر دنیا کی سب سے بڑی اسٹرابیری کی ہے۔ وشواس نیوز نے اپنی پڑتال میں پایا کہ وائرل کی جا رہی تصویر کو آرٹیفیشئل انٹیلیجنس کی تکنیک کی تیار کیا گیا ہے،"
      },
      {
        "before": " تصویر میں نظر آرہی چرواہا بچی فرانس کی سابق وزیر تعلیم نجات ولود نہیں ہے۔ تقریبا ایک دہائی قبل کی یہ تصویر یونیسیف کے ایک پروجیکٹ کے دوران مراکش میں فوٹوگرافر گائیکومو پروزی نے کھینچی تھی",
        "after": "تصویر میں نظر آرہی چرواہا بچی فرانس کی سابق وزیر تعلیم نجات ولود نہیں ہے۔ تقریبا ایک دہائی قبل کی یہ تصویر یونیسیف کے ایک پروجیکٹ کے دوران مراکش میں فوٹوگرافر گائیکومو پروزی نے کھینچی تھی"
      },
      {
        "before": "ویڈیو میں  ہندوستانی اور پاکستانی فوجیوں کو ایک جنگ میں دکھایا گیا ہے",
        "after": "ویڈیو میں ہندوستانی اور پاکستانی فوجیوں کو ایک جنگ میں دکھایا گیا ہے"
      },
      {
        "before": "متن کے ساتھ بینر رکھنے والے پاکستان لوگوں کی تصویر - ہم کشمیر نہیں چاہتے ہیں۔ ہمیں ہمیں ہائیڈروکسی کلوروکوئن دیں ",
        "after": "متن کے ساتھ بینر رکھنے والے پاکستان لوگوں کی تصویر - ہم کشمیر نہیں چاہتے ہیں۔ ہمیں ہمیں ہائیڈروکسی کلوروکوئن دیں"
      },
      {
        "before": "پاکستانی کرکٹر کی تصویر سابقہ ​​کرسچن یوسف یوہانا اور ہندو دانش کنیریا کو نماز ادا کرنے پر مجبور کیا گیا",
        "after": "پاکستانی کرکٹر کی تصویر سابقہ کرسچن یوسف یوہانا اور ہندو دانش کنیریا کو نماز ادا کرنے پر مجبور کیا گیا"
      },
      {
        "before": "پاکستانی وزیر اعظم عمران خان کی سابقہ ​​اہلیہ ، جیمیما گولڈسمتھ نے ایک بچی کو جنم دیا ہے",
        "after": "پاکستانی وزیر اعظم عمران خان کی سابقہ اہلیہ ، جیمیما گولڈسمتھ نے ایک بچی کو جنم دیا ہے"
      },
      {
        "before": " آج تک نے اطلاع کیا ہے کہ عمران خان کی اہلیہ کا کورونا ٹیسٹ مثبت آیا ہے",
        "after": "آج تک نے اطلاع کیا ہے کہ عمران خان کی اہلیہ کا کورونا ٹیسٹ مثبت آیا ہے"
      },
      {
        "before": "گزشتہ روز وزیر اعظم نریدر مودی نے امریکہ کا دورہ کیا تھا اور اسی کے بعد سے ایک ویڈیو سوشل میڈیا پر وائرل کی جا رہی ہے جس میں لوگوں کو پی ایم مودی کی مخالفت کرتے ہوئے دیکھا جا سکتا ہے۔ ویڈیو کو شیئر کرتے ہوئے صارفین دعوی کر رہے ہیں کہ پی ایم مودی کے حالیہ امریکی دورہ کے دوران کا یہ احتجاج کا ویڈیو ہے",
        "after": "گزشتہ روز وزیر اعظم نریدر مودی نے امریکہ کا دورہ کیا تھا اور اسی کے بعد سے ایک ویڈیو سوشل میڈیا پر وائرل کی جا رہی ہے جس میں لوگوں کو پی ایم مودی کی مخالفت کرتے ہوئے دیکھا جا سکتا ہے۔ ویڈیو کو شیئر کرتے ہوئے صارفین دعوی کر رہے ہیں کہ پی ایم مودی کے حالیہ امریکی دورہ کے دوران کا یہ احتجاج کا ویڈیو ہے"
      },
      {
        "before": "ملک بھر میں بڑھتے کورونا وائرس کے معاملوں کے مد نظر متعدد غیر ممالک نے اپنی سطح پر امداد کے لئے ہاتھ بڑھایا ہے۔ اب اسی کے تحت سوشل میڈیا پر ایک ویڈیو وائرل ہو رہا ہے جس میں بہت سے ٹینکروں کو دیکھا جا سکتا ہے۔ ویڈیو کو شیئر کرتے ہوئے صارفین دعوی کر رہے ہیں کہ یہ ٹینکر سعودی عرب سے بھیجی گئی آکسیجن ہ",
        "after": "ملک بھر میں بڑھتے کورونا وائرس کے معاملوں کے مد نظر متعدد غیر ممالک نے اپنی سطح پر امداد کے لئے ہاتھ بڑھایا ہے۔ اب اسی کے تحت سوشل میڈیا پر ایک ویڈیو وائرل ہو رہا ہے جس میں بہت سے ٹینکروں کو دیکھا جا سکتا ہے۔ ویڈیو کو شیئر کرتے ہوئے صارفین دعوی کر رہے ہیں کہ یہ ٹینکر سعودی عرب سے بھیجی گئی آکسیجن ہی"
      },
      {
        "before": "سوشل میڈیا پر ایک سوڈان کی دار الحکومت برج الفتح عمارت کی ایک تصویر وائرل ہو رہی ہے جس میں عمارت سے آگ اور دھواں نکلتے ہوئے دیکھا جا سکتا ہے۔ تصویر کو شیئر کرتے ہوئے صارفین دعوی کر رہے ہیں کہ برج الفتح میں حملہ ہوا ہے",
        "after": "سوشل میڈیا پر ایک سوڈان کی دار الحکومت برج الفتح عمارت کی ایک تصویر وائرل ہو رہی ہے جس میں عمارت سے آگ اور دھواں نکلتے ہوئے دیکھا جا سکتا ہے۔ تصویر کو شیئر کرتے ہوئے صارفین دعوی کر رہے ہیں کہ برج الفتح میں حملہ ہوا ہے"
      },
      {
        "before": "\nسٹٹگارٹ (اُردو پوائنٹ اخبارتازہ ترین 03 دسمبر2018ء) جرمنی کی موٹر ساز کمپنی ڈیملر نے آئندہ سال سے چین میں امرکین ٹیرف کی وجہ سے الیکٹرک کاریں بند کرنے کا اعلان کیا ہے ڈیملر کے چین کے حوالے سے شعبے کے سربراہ ہوبرٹس ٹروسکا نے بتایا کہ کمپنی آئندہ سال 2019 کے آخر تک چین میں الیکٹرک کاروں کی پیداوار",
        "after": "سٹٹگارٹ (اُردو پوائنٹ اخبارتازہ ترین 03 دسمبر2018ء) جرمنی کی موٹر ساز کمپنی ڈیملر نے آئندہ سال سے چین میں امرکین ٹیرف کی وجہ سے الیکٹرک کاریں بند کرنے کا اعلان کیا ہے ڈیملر کے چین کے حوالے سے شعبے کے سربراہ ہوبرٹس ٹروسکا نے بتایا کہ کمپنی آئندہ سال 2019 کے آخر تک چین میں الیکٹرک کاروں کی پیداوار بند"
      },
      {
        "before": "کراچی ( آن لائن ) حکومت نے عوام کو باہرکریڈٹ یا ڈیبٹ کارڈ استعمال کرنے پر ٹیکس معاف کر دیا اگر آپ سعودیہ عرب عمرہ یا حج کے سلسلے میں جارہے ہیں یا کسی کام کے سلسلے میں کسی اور ملک جا رہے ہیں تو اپکو ساتھ کرنسی لے جانے کی کوئی ضرورت نہیں ہے کیونکہ بینک ڈیبٹ یا کریڈٹ کارڈ کے استعمال پر آپکو ٹیکس ادا نہ",
        "after": "کراچی ( آن لائن ) حکومت نے عوام کو باہرکریڈٹ یا ڈیبٹ کارڈ استعمال کرنے پر ٹیکس معاف کر دیا اگر آپ سعودیہ عرب عمرہ یا حج کے سلسلے میں جارہے ہیں یا کسی کام کے سلسلے میں کسی اور ملک جا رہے ہیں تو اپکو ساتھ کرنسی لے جانے کی کوئی ضرورت نہیں ہے کیونکہ بینک ڈیبٹ یا کریڈٹ کارڈ کے استعمال پر آپکو ٹیکس ادا نہ"
      },
      {
        "before": "لاہور(کامرس رپورٹر) لاہور چیمبر کے صدر الماس حیدر نے حکومت پر زور دیتے ہوئے کہا ہے کہ وہ کاروباری برادری کے لئے جدید ٹیکنالوجی اور ون ونڈو آپریشن سسٹم کے ذریعے پراپرٹی کی رجسٹریشن کے عمل میں آسانی پیدا کرنے کے حکومتی اقدام کو بہت سراہتے ہیں اور وہ حکومت پاکستان کے مشکور ہیں لاہور چیمبر کے صدر نے ک",
        "after": "لاہور(کامرس رپورٹر) لاہور چیمبر کے صدر الماس حیدر نے حکومت پر زور دیتے ہوئے کہا ہے کہ وہ کاروباری برادری کے لئے جدید ٹیکنالوجی اور ون ونڈو آپریشن سسٹم کے ذریعے پراپرٹی کی رجسٹریشن کے عمل میں آسانی پیدا کرنے کے حکومتی اقدام کو بہت سراہتے ہیں اور وہ حکومت پاکستان کے مشکور ہیں لاہور چیمبر کے صدر نے کہا"
      },
      {
        "before": "کوئٹہ ( آن لائن ) چینی ریسرچ اور سرمایہ کار کمپنی ٹونگسِن ریسورس لمیٹڈ نے بلوچستان کے معدنی وسائل کو ترقی دینے میں دلچسپی ظاہر کی ہے وزیراعلی بلوچستان جام میر کمال خان علیانی سے ہونے والی ایک ملاقات میں کمپنی کے صدر وینگ جِنچینگ نے صوبے کے قدرتی وسائل دریافت کرنے کی پیشکش کی انہوں نے وزیراعلی کو بتا",
        "after": "کوئٹہ ( آن لائن ) چینی ریسرچ اور سرمایہ کار کمپنی ٹونگسِن ریسورس لمیٹڈ نے بلوچستان کے معدنی وسائل کو ترقی دینے میں دلچسپی ظاہر کی ہے وزیراعلی بلوچستان جام میر کمال خان علیانی سے ہونے والی ایک ملاقات میں کمپنی کے صدر وینگ جِنچینگ نے صوبے کے قدرتی وسائل دریافت کرنے کی پیشکش کی انہوں نے وزیراعلی کو بتا"
      },
      {
        "before": "وزرات خزانہ نے برآمد کنندگان کے لیے گیس سبسڈی کی مد میں 25 ارب 15 کروڑ روپے سوئی نادرن کو جاری کرنے سے انکار کر دیا وزرات خزانہ کے جاری کردہ نوٹیفکیشن کے مطابق سبسڈی کی مد میں جاری کی جانے والی رقم بیلنس میں کمی کی وجہ سے نہیں کی  گئی یہ سبسڈی 5 برآمدی شعبوں ٹیکسٹائل کارپٹس چمڑے اسپورٹس سرجیکل آلات ",
        "after": "وزرات خزانہ نے برآمد کنندگان کے لیے گیس سبسڈی کی مد میں 25 ارب 15 کروڑ روپے سوئی نادرن کو جاری کرنے سے انکار کر دیا وزرات خزانہ کے جاری کردہ نوٹیفکیشن کے مطابق سبسڈی کی مد میں جاری کی جانے والی رقم بیلنس میں کمی کی وجہ سے نہیں کی گئی یہ سبسڈی 5 برآمدی شعبوں ٹیکسٹائل کارپٹس چمڑے اسپورٹس سرجیکل آلات ک"
      },
      {
        "before": "اسلام آباد (اُردو پوائنٹ اخبارتازہ ترین 05 دسمبر2018ء) بینک اسلامی پاکستان لیمیٹد اورانڈس موٹرز کمپنی لمیٹڈ نے مفاہمت کی ایک دستاویز پردستخط کردئے ہیں جس کے تحت بنک اپنے صارفین کو ملک بھر میں 10 سال کے لیے قستوں پر بڑی گاڑیوں ٹویوٹا فارچونر ریو کیمرے اور رش  کی سہولیات فراہم کرے گا بدھ کو جاری بیان",
        "after": "اسلام آباد (اُردو پوائنٹ اخبارتازہ ترین 05 دسمبر2018ء) بینک اسلامی پاکستان لیمیٹد اورانڈس موٹرز کمپنی لمیٹڈ نے مفاہمت کی ایک دستاویز پردستخط کردئے ہیں جس کے تحت بنک اپنے صارفین کو ملک بھر میں 10 سال کے لیے قستوں پر بڑی گاڑیوں ٹویوٹا فارچونر ریو کیمرے اور رش کی سہولیات فراہم کرے گا بدھ کو جاری بیان ک"
      },
      {
        "before": "پاکستان کے ہوائی جہاز ہوا میں ہی غائب ہیں پی آئی اے کے سی ای او ضیاء قادر قریشی پتہ نہ چلا سکے اور انھیں عہدے سے برطرف کردیا گیا ذرائع کے مطابق ضیاء قادر قریشی اپنا کام صحیح طور پر سر انجام نہیں دے رہے تھے ایک رپورٹ کے تحت وہ اپنا سارا وقت پیزا کھانے میں گزار دیتے تھے مزید انکشاف بھی ہوا کہ ان کو جہ",
        "after": "پاکستان کے ہوائی جہاز ہوا میں ہی غائب ہیں پی آئی اے کے سی ای او ضیاء قادر قریشی پتہ نہ چلا سکے اور انھیں عہدے سے برطرف کردیا گیا ذرائع کے مطابق ضیاء قادر قریشی اپنا کام صحیح طور پر سر انجام نہیں دے رہے تھے ایک رپورٹ کے تحت وہ اپنا سارا وقت پیزا کھانے میں گزار دیتے تھے مزید انکشاف بھی ہوا کہ ان کو جہ"
      },
      {
        "before": "اسلام آباد (مانیٹرنگ ڈیسک) دنیا کی سب سے مقبول کار کمپنی ٹویوٹا پاکستان میں ٹویوٹا کرولا 2020 کے مختلف ماڈلز خصوصی ڈسکاؤنٹ پر متعارف کروا ے گی حالیہ رپورٹس کے مطابق پاکستان میں لوگوں کا  ٹویوٹا کی تیار کردہ کاروں میں کم  رجحان نوٹ گیا ہے اور جاپانی کمپنیوں نے مارکیٹ کو کنٹرول کر لیا ہے جس سے ٹویوٹا",
        "after": "اسلام آباد (مانیٹرنگ ڈیسک) دنیا کی سب سے مقبول کار کمپنی ٹویوٹا پاکستان میں ٹویوٹا کرولا 2020 کے مختلف ماڈلز خصوصی ڈسکاؤنٹ پر متعارف کروا ے گی حالیہ رپورٹس کے مطابق پاکستان میں لوگوں کا ٹویوٹا کی تیار کردہ کاروں میں کم رجحان نوٹ گیا ہے اور جاپانی کمپنیوں نے مارکیٹ کو کنٹرول کر لیا ہے جس سے ٹویوٹا کا"
      },
      {
        "before": "   5 ارب سے زائد افراد اس وقت سوشل میڈیا چینل فیس بک کو ہر ماہ استعمال کرتے ہیں اور یہی وجہ ہے کہ سوشل نیٹ ورک کی نیوز فیڈ میں نئی نئی تبدیلیاں آئے روز متعارف کرائی جا رہی ہیں جس کو استعمال کرنے صارفین صرف اپنی پسندیدہ خبریں دیکھ سکے گے یہ نیا پروگرام  صارفین کی پسند کو سمجھنے کی صلاحیت رکھے گا ہے ف",
        "after": "5 ارب سے زائد افراد اس وقت سوشل میڈیا چینل فیس بک کو ہر ماہ استعمال کرتے ہیں اور یہی وجہ ہے کہ سوشل نیٹ ورک کی نیوز فیڈ میں نئی نئی تبدیلیاں آئے روز متعارف کرائی جا رہی ہیں جس کو استعمال کرنے صارفین صرف اپنی پسندیدہ خبریں دیکھ سکے گے یہ نیا پروگرام صارفین کی پسند کو سمجھنے کی صلاحیت رکھے گا ہے فیس ب"
      },
      {
        "before": "بھارت کے خلائی ادارے نے ایک ستارے پر تين روبوٹ گاڑیاں اتار کر نیا ريکارڈ قائم کر دیا ہے اور اب روبوٹ گاڑیاں ستارے کی سطح کی فلم زمین تک بھیج رہی ہیں۔ یہ تينوں گاڑیاں ہایابوسا-3 نامی خلائی جہاز سے ستاروں سے بھیجی گئیں جو چھ کلومیٹر لمبے ستارے 'ریوگو' کے گرد چکر کاٹ رہا ہے۔ یہ گاڑیاں ستارے کا رقبہ ناپ",
        "after": "بھارت کے خلائی ادارے نے ایک ستارے پر تین روبوٹ گاڑیاں اتار کر نیا ریکارڈ قائم کر دیا ہے اور اب روبوٹ گاڑیاں ستارے کی سطح کی فلم زمین تک بھیج رہی ہیں۔ یہ تینوں گاڑیاں ہایابوسا-3 نامی خلائی جہاز سے ستاروں سے بھیجی گئیں جو چھ کلومیٹر لمبے ستارے 'ریوگو' کے گرد چکر کاٹ رہا ہے۔ یہ گاڑیاں ستارے کا رقبہ ناپ"
      },
      {
        "before": "فیس بک نے گزشتہ سالاپنی نیوز فیڈ میں سب سے اہم جدت کا انکشاف کرتے ہوئے کہا تھا کہ اب اس میں تصاویر اور شاعری  کے مقابلے عام لوگوں کی پوسٹیں زیادہ نظر آئیں گی۔ تاہم فیس بک کے اس انکشاف کے محض 2 ہفتے بعد یہ خبر سامنے آئی کہ اس جدت سے پرنٹ میڈیا پر فضول خبریں تیزی سے اور زیادہ جھپنے کا امکان ہے۔ چينی",
        "after": "فیس بک نے گزشتہ سالاپنی نیوز فیڈ میں سب سے اہم جدت کا انکشاف کرتے ہوئے کہا تھا کہ اب اس میں تصاویر اور شاعری کے مقابلے عام لوگوں کی پوسٹیں زیادہ نظر آئیں گی۔ تاہم فیس بک کے اس انکشاف کے محض 2 ہفتے بعد یہ خبر سامنے آئی کہ اس جدت سے پرنٹ میڈیا پر فضول خبریں تیزی سے اور زیادہ جھپنے کا امکان ہے۔ چینی می"
      },
      {
        "before": "گزشتہ چند سالوں سے ٹک ٹاک ایپ صارفین کی پسندیدہ ایپ بن چکی ہے جس کے پانچ ملین سے زیادہ یوزرز ہو گے ہیں اتنے کم عرصے میں کسی اور ایپ کو اتنی مقبولیت حاصل نہیں ہوئی جتنی شہرت ٹک ٹاک حاصل کرنے میں کامیابی رہی ہے مزید یوزرز کو متاثر کرنے کے لیے اس میں کچھ ایسے فیچرز متعارف کرائے جا رہے ہیں جس سے نہ درف ",
        "after": "گزشتہ چند سالوں سے ٹک ٹاک ایپ صارفین کی پسندیدہ ایپ بن چکی ہے جس کے پانچ ملین سے زیادہ یوزرز ہو گے ہیں اتنے کم عرصے میں کسی اور ایپ کو اتنی مقبولیت حاصل نہیں ہوئی جتنی شہرت ٹک ٹاک حاصل کرنے میں کامیابی رہی ہے مزید یوزرز کو متاثر کرنے کے لیے اس میں کچھ ایسے فیچرز متعارف کرائے جا رہے ہیں جس سے نہ درف "
      },
      {
        "before": "فیصل آباد گورنمنٹ کالج یونیورسٹی کے ایک طالبعلم نے خوراک میں موجود انتہائی زہريلے  مرکب آرسینک کو خوراک سے الگ کرنے کیلئے پاکستان کا سستا ترین فلٹر تیار کرنیکا دعویٰ کیا ہے۔فیصل آباد کی کورنمنٹ کالج یونیورسٹی کے ڈاکٹر نبیل نیازی نے کيلے  کے چھلکے کی مدد سے حوراک سے آرسینک کو الگ کرنے کے لیے پاکس",
        "after": "فیصل آباد گورنمنٹ کالج یونیورسٹی کے ایک طالبعلم نے خوراک میں موجود انتہائی زہریلے مرکب آرسینک کو خوراک سے الگ کرنے کیلئے پاکستان کا سستا ترین فلٹر تیار کرنیکا دعویٰ کیا ہے۔فیصل آباد کی کورنمنٹ کالج یونیورسٹی کے ڈاکٹر نبیل نیازی نے کیلے کے چھلکے کی مدد سے حوراک سے آرسینک کو الگ کرنے کے لیے پاکستان کا"
      },
      {
        "before": " بھارت میں ایپل ایپ سٹور سمیت دیگر ایپ سٹورز سے انسٹاگرام اور ٹوئٹرکو ہٹا دیا گیا ہے۔ ایپل کا کہنا ہے کہ اس کی کئی دوسری ایپس میں سے ایک کو انتظاميہ  کی جانب سے یہ کہہ کر ہٹا دیا گیا ہے کہ یہ صوبائی قانون سے مطابقت نہیں رکھتیں۔ ٹوئٹر کی مالک کمپنی گوگل نے سی اين اين کو بتایا کہ اس ایپ کو 'مستقل  طور",
        "after": "بھارت میں ایپل ایپ سٹور سمیت دیگر ایپ سٹورز سے انسٹاگرام اور ٹوئٹرکو ہٹا دیا گیا ہے۔ ایپل کا کہنا ہے کہ اس کی کئی دوسری ایپس میں سے ایک کو انتظامیہ کی جانب سے یہ کہہ کر ہٹا دیا گیا ہے کہ یہ صوبائی قانون سے مطابقت نہیں رکھتیں۔ ٹوئٹر کی مالک کمپنی گوگل نے سی این این کو بتایا کہ اس ایپ کو 'مستقل طور پر"
      },
      {
        "before": "اسلام آباد(نیو زڈیسک) ناسا خلائی سیاروں پر زندگی کے اثرات ڈھونڈنے میں انتھک محنت کر رہا ہے ناسا نے بغیر پائلٹ خلائی جہاز کو خلا میں بیجھنے کا کامیاب تجربہ کیا ہے اس خلائی جہاز  کا نام 'انسائٹ' رکھا گیا ہے جو تقریباً 7 ماہ کے خلائی سفر کے بعد مریخ کی سطح پر کامیابی سے  اتر گیا ہے جس نے کچھ سیکنڈز بع",
        "after": "اسلام آباد(نیو زڈیسک) ناسا خلائی سیاروں پر زندگی کے اثرات ڈھونڈنے میں انتھک محنت کر رہا ہے ناسا نے بغیر پائلٹ خلائی جہاز کو خلا میں بیجھنے کا کامیاب تجربہ کیا ہے اس خلائی جہاز کا نام 'انسائٹ' رکھا گیا ہے جو تقریباً 7 ماہ کے خلائی سفر کے بعد مریخ کی سطح پر کامیابی سے اتر گیا ہے جس نے کچھ سیکنڈز بعد ن"
      },
      {
        "before": "پاکستان ۔ (اُردو پوائنٹ اخبارتازہ ترین۔ 17  جون 2018ء)  دوسرے ممالک کی طرح پاکستان کی وزارت تعلیم ملک میں تعلیمی نظام کو بہتر بنانے کے لیے کوشاں ہیں چونکہ  پاکستان میں پر انگریزی لکھنے یا بولنے میں طلبا اچھّے نہیں ہیں تو اسی بات کو مدنظر رکھتے ہوئے وزارت تعلیم سکولوں میں انگریزی زبان بولنے والے مصنو",
        "after": "پاکستان ۔ (اُردو پوائنٹ اخبارتازہ ترین۔ 17 جون 2018ء) دوسرے ممالک کی طرح پاکستان کی وزارت تعلیم ملک میں تعلیمی نظام کو بہتر بنانے کے لیے کوشاں ہیں چونکہ پاکستان میں پر انگریزی لکھنے یا بولنے میں طلبا اچھّے نہیں ہیں تو اسی بات کو مدنظر رکھتے ہوئے وزارت تعلیم سکولوں میں انگریزی زبان بولنے والے مصنوعی "
      },
      {
        "before": "لاہور (ڈیلی پاکستان آن لائن) وفاقی حکومت نے رجسٹرڈ موبائل فونز پر سبسڈی دینے کا اعلان کر دیا ہے اور وفاقی وزیر مملکت برائے ریونیو حماد اظہر کا کہنا ہے کہ 15 فروری کے بعد تمام رجسٹرڈ موبائل فونز مذید سستے کر دئیے جائیں گے تفصیلات کے مطابق لاہور میں واہگہ بارڈر پر ورلڈ کسٹمز ڈے کی مناسبت سے منعقدہ تقر",
        "after": "لاہور (ڈیلی پاکستان آن لائن) وفاقی حکومت نے رجسٹرڈ موبائل فونز پر سبسڈی دینے کا اعلان کر دیا ہے اور وفاقی وزیر مملکت برائے ریونیو حماد اظہر کا کہنا ہے کہ 15 فروری کے بعد تمام رجسٹرڈ موبائل فونز مذید سستے کر دئیے جائیں گے تفصیلات کے مطابق لاہور میں واہگہ بارڈر پر ورلڈ کسٹمز ڈے کی مناسبت سے منعقدہ تقر"
      },
      {
        "before": "اسلام آباد(نیو زڈیسک،19 اکتوبر 2018) سائنسدانوں نے دل کے ایسے ننھے حصے کو دریافت کر لیا ہے جو صرف انسانوں میں پایا جاتا ہے اور یہی انہیں دیگر جانداروں کے مقابل میں منفرد بناتا ہے محققین کا کہنا ہے کہ یہ حیرت انگیز دریافت دل کے امراض کے ٹرانسپیرنٹ کے علاج میں معاون ثابت ہو سکتا ہے سے45 سالوں سے اس ت",
        "after": "اسلام آباد(نیو زڈیسک،19 اکتوبر 2018) سائنسدانوں نے دل کے ایسے ننھے حصے کو دریافت کر لیا ہے جو صرف انسانوں میں پایا جاتا ہے اور یہی انہیں دیگر جانداروں کے مقابل میں منفرد بناتا ہے محققین کا کہنا ہے کہ یہ حیرت انگیز دریافت دل کے امراض کے ٹرانسپیرنٹ کے علاج میں معاون ثابت ہو سکتا ہے سے45 سالوں سے اس تح"
      },
      {
        "before": "اسلام آباد(نیو زڈیسک)چینی سائنسدانوں نے چاند اور مٹی جیسے قابلِ تحلیل (رینیوایبل) ذرائع سے بننے والی توانائی کو مؤثر انداز میں ذيادہ کرنے والا ایک نظام ايجاد کیا ہے جسے ’صندوق میں سورج‘ کا نام دیا گیا ہے۔یاد رہے کہ قابلِ تحلیل ذرائع توانائی کو ذیادہ کرنے کا مؤثر نظام پاکستان میں کہیں رائج  نہیں ا",
        "after": "اسلام آباد(نیو زڈیسک)چینی سائنسدانوں نے چاند اور مٹی جیسے قابلِ تحلیل (رینیوایبل) ذرائع سے بننے والی توانائی کو مؤثر انداز میں ذیادہ کرنے والا ایک نظام ایجاد کیا ہے جسے ’صندوق میں سورج‘ کا نام دیا گیا ہے۔یاد رہے کہ قابلِ تحلیل ذرائع توانائی کو ذیادہ کرنے کا مؤثر نظام پاکستان میں کہیں رائج نہیں اور ا"
      },
      {
        "before": "پاکستان نے یونیورسٹی آف پنجاب کی  طالبات کو کسی بھی شعبے میں نوکری دینے سے انکار کر دیا",
        "after": "پاکستان نے یونیورسٹی آف پنجاب کی طالبات کو کسی بھی شعبے میں نوکری دینے سے انکار کر دیا"
      },
      {
        "before": "ماہرین کا کہنا ہے کہ کرونا  پوری نیند نہ لینے والوں پر حملہ کرتا ہے",
        "after": "ماہرین کا کہنا ہے کہ کرونا پوری نیند نہ لینے والوں پر حملہ کرتا ہے"
      },
      {
        "before": " محکمہ موسمیات کا کہنا ہے کہ سورج سب سے پہلے پاکستان میں نکلتا ہے اور دوسرے نمبر پر امریکہ میں تیسرے نمبر پر سعودی عرب میں",
        "after": "محکمہ موسمیات کا کہنا ہے کہ سورج سب سے پہلے پاکستان میں نکلتا ہے اور دوسرے نمبر پر امریکہ میں تیسرے نمبر پر سعودی عرب میں"
      },
      {
        "before": " حکومت نے اعلان کر دیا کہ ہر مہینے ہر گھر کو پانچ ہزار روپیہ دیا جائے گا",
        "after": "حکومت نے اعلان کر دیا کہ ہر مہینے ہر گھر کو پانچ ہزار روپیہ دیا جائے گا"
      },
      {
        "before": " ایپل نے اپنے موبائل فون پاکستان میں سپلائی کرنے سے انکار کر دیا",
        "after": "ایپل نے اپنے موبائل فون پاکستان میں سپلائی کرنے سے انکار کر دیا"
      },
      {
        "before": " چائنہ نے پاکستان سے اپنی پاک چین دوستی ختم کر دیں",
        "after": "چائنہ نے پاکستان سے اپنی پاک چین دوستی ختم کر دیں"
      },
      {
        "before": " مریم نواز کی فٹ بال کھیلتے ہوئے ٹانگ ٹوٹ گئی",
        "after": "مریم نواز کی فٹ بال کھیلتے ہوئے ٹانگ ٹوٹ گئی"
      },
      {
        "before": " شہباز شریف نے پان کھانا شروع کر دیا اور رات تو وہ اپنی گاڑی میں نشے میں چور ملے",
        "after": "شہباز شریف نے پان کھانا شروع کر دیا اور رات تو وہ اپنی گاڑی میں نشے میں چور ملے"
      },
      {
        "before": " پاکستان میں انوکھا اعلان آج کے بعد صرف سات رنگوں والا سوٹ پہننا جائز ہے کوئی بھی پاکستانی کسی دوسرے رنگ کا سوٹ نہیں پہن سکتا",
        "after": "پاکستان میں انوکھا اعلان آج کے بعد صرف سات رنگوں والا سوٹ پہننا جائز ہے کوئی بھی پاکستانی کسی دوسرے رنگ کا سوٹ نہیں پہن سکتا"
      },
      {
        "before": " حکومت کا انوکھا اعلان عید کے دن کوئی نیا سوٹ نہیں پہنے گا",
        "after": "حکومت کا انوکھا اعلان عید کے دن کوئی نیا سوٹ نہیں پہنے گا"
      },
      {
        "before": " عمران خان اور نواز شریف کی آپس میں گہری دوستی کی خبریں پھیل گئی ",
        "after": "عمران خان اور نواز شریف کی آپس میں گہری دوستی کی خبریں پھیل گئی"
      },
      {
        "before": " عمران خان کا کہنا ہے کہ نواز شریف بھائی کی طرح ہے",
        "after": "عمران خان کا کہنا ہے کہ نواز شریف بھائی کی طرح ہے"
      },
      {
        "before": " بلاول بھٹو فلم پنجاب میں لڑکی کا کردار نبھائیں گے",
        "after": "بلاول بھٹو فلم پنجاب میں لڑکی کا کردار نبھائیں گے"
      },
      {
        "before": " نواز شریف نے اپنی دوسری شادی کا اعلان کر دیا",
        "after": "نواز شریف نے اپنی دوسری شادی کا اعلان کر دیا"
      },
      {
        "before": " امریکہ کے صدر نے میٹرک تک اردو کا سبجیکٹ لازمی قرار دے دیا",
        "after": "امریکہ کے صدر نے میٹرک تک اردو کا سبجیکٹ لازمی قرار دے دیا"
      }
    ]
  },
  "btt": {
    "dataset": "bend_the_truth",
    "rows_in": 900,
    "rows_out": 900,
    "pct_modified": 86.44444444444444,
    "dropped_empty_after_cleaning": 0,
    "unique_chars_before": 172,
    "unique_chars_after": 162,
    "len_stats_before": {
      "min": 313,
      "median": 1224.5,
      "p95": 3849.5499999999993,
      "max": 10939
    },
    "len_stats_after": {
      "min": 306,
      "median": 1222.5,
      "p95": 3831.3999999999996,
      "max": 10907
    },
    "examples_before_after": [
      {
        "before": "پاکستان کے وزیراعظم عمران خان سعودی عرب کے دارالحکومت ریاض میں ملک میں سرمایہ کاری کے حوالے سے سالانہ کانفرنس میں شرکت کر رہے ہیں حکومت پاکستان کا کہنا ہے کہ سعودی عرب نے پاکستان کو معاشی بحران سے نمٹنے میں مدد کے لیے ایک سال کے لیے تین ارب ڈالر دینے پر اتفاق کیا ہے دفترِ خارجہ کی جانب سے منگل کی شب",
        "after": "پاکستان کے وزیراعظم عمران خان سعودی عرب کے دارالحکومت ریاض میں ملک میں سرمایہ کاری کے حوالے سے سالانہ کانفرنس میں شرکت کر رہے ہیں حکومت پاکستان کا کہنا ہے کہ سعودی عرب نے پاکستان کو معاشی بحران سے نمٹنے میں مدد کے لیے ایک سال کے لیے تین ارب ڈالر دینے پر اتفاق کیا ہے دفترِ خارجہ کی جانب سے منگل کی شب"
      },
      {
        "before": "پاکستان اسٹاک ایکسچینج (پی ایس ایکس) میں کاروباری ہفتے کے آخری روز مثبت رجحان دیکھنے میں آیا اور بینچ مارک کے ایس ای 100 انڈیکس 485 پوائنٹس اضافے سے 42 ہزار 446 پوائنٹس کی سطح پر بند ہوا قومی اسمبلی میں وزیر اعظم کے انتخاب سے قبل حصص مارکیٹ میں جہاں گزشتہ روز تقریباً 700 پوائنٹس کی کمی ہوئی تھی کارو",
        "after": "پاکستان اسٹاک ایکسچینج (پی ایس ایکس) میں کاروباری ہفتے کے آخری روز مثبت رجحان دیکھنے میں آیا اور بینچ مارک کے ایس ای 100 انڈیکس 485 پوائنٹس اضافے سے 42 ہزار 446 پوائنٹس کی سطح پر بند ہوا قومی اسمبلی میں وزیر اعظم کے انتخاب سے قبل حصص مارکیٹ میں جہاں گزشتہ روز تقریباً 700 پوائنٹس کی کمی ہوئی تھی کارو"
      },
      {
        "before": "سندھ کے محکمہ ریونیو نے کراچی میں بحریہ ٹاؤن کو دی جانے والی ہزاروں ایکڑ زمین کی الاٹمنٹ منسوخ کر دی ہے۔\n\nیہ فیصلہ سپریم کورٹ کے احکامات کی روشنی میں کیا گیا ہے۔ ملیر ڈویلپمنٹ اتھارٹی کے لیے مختص 14617 ایکڑ زمین کی الاٹمنٹ کا حکم نامہ بھی مسترد کردیا گیا ہے۔\n\nسپریم کورٹ کے فیصلے پر عملدرآمد کے لیے ق",
        "after": "سندھ کے محکمہ ریونیو نے کراچی میں بحریہ ٹاؤن کو دی جانے والی ہزاروں ایکڑ زمین کی الاٹمنٹ منسوخ کر دی ہے۔ یہ فیصلہ سپریم کورٹ کے احکامات کی روشنی میں کیا گیا ہے۔ ملیر ڈویلپمنٹ اتھارٹی کے لیے مختص 14617 ایکڑ زمین کی الاٹمنٹ کا حکم نامہ بھی مسترد کردیا گیا ہے۔ سپریم کورٹ کے فیصلے پر عملدرآمد کے لیے قائ"
      },
      {
        "before": "تصویر کے کاپی رائٹ AFP\n\nپاکستان کے بارے میں کئی ایسی چیزیں ہیں جو کہ آپ کو حیران کر سکتی ہیں چاہے وہ کرکٹ ٹیم کی پرفارمنس ہو یا ملک کے بازارِ حصص میں شدید مندی سے زبردست تیزی کا رجحان ہو۔\n\nدو دن پہلے تک پاکستان سٹاک ایکسچینج کا انڈیکس مندی کا شکار تھا لیکن منگل کی رات کو سعودی عرب کی جانب سے امدادی ",
        "after": "تصویر کے کاپی رائٹ AFP پاکستان کے بارے میں کئی ایسی چیزیں ہیں جو کہ آپ کو حیران کر سکتی ہیں چاہے وہ کرکٹ ٹیم کی پرفارمنس ہو یا ملک کے بازارِ حصص میں شدید مندی سے زبردست تیزی کا رجحان ہو۔ دو دن پہلے تک پاکستان سٹاک ایکسچینج کا انڈیکس مندی کا شکار تھا لیکن منگل کی رات کو سعودی عرب کی جانب سے امدادی پی"
      },
      {
        "before": "ریاض (اُردو پوائنٹ اخبارتازہ ترین 18 دسمبر2018ء) سعودی عرب دنیا میں اسلحہ درآمد کرنے والا سب سے بڑا ملک بن گیا سٹاک ہوم انٹرنیشنل ریشرچ انسٹیٹیوٹ کی جانب سے جاری کردہ عداد و شمار کے مطابق سعودی عرب نے 2017ء میں دنیا بھر میں سب سے زیادہ اسلحہ خریدا ہے جبکہ فرانس بھی اس شعبے میں صف اول کے ممالک میں ش",
        "after": "ریاض (اُردو پوائنٹ اخبارتازہ ترین 18 دسمبر2018ء) سعودی عرب دنیا میں اسلحہ درآمد کرنے والا سب سے بڑا ملک بن گیا سٹاک ہوم انٹرنیشنل ریشرچ انسٹیٹیوٹ کی جانب سے جاری کردہ عداد و شمار کے مطابق سعودی عرب نے 2017ء میں دنیا بھر میں سب سے زیادہ اسلحہ خریدا ہے جبکہ فرانس بھی اس شعبے میں صف اول کے ممالک میں شا"
      },
      {
        "before": "اسلام آباد: چیف جسٹس سپریم کورٹ آف پاکستان میاں ثاقب نثار نے پاکستان انٹر نیشنل ایئرلائن (پی آئی اے) طیاروں پر قومی پرچم کی جگہ مارخور کی تصویر لگانے کا نوٹس لیتے ہوئے ادارے کو مذکورہ اقدام سے عارضی طور پر روک دیا۔\n\nمیاں ثاقب نثارنے ریماکس دیئے کہ قومی پرچم کی جگہ ایک جانور کی تصویر لگائی جا رہی ہ",
        "after": "اسلام آباد: چیف جسٹس سپریم کورٹ آف پاکستان میاں ثاقب نثار نے پاکستان انٹر نیشنل ایئرلائن (پی آئی اے) طیاروں پر قومی پرچم کی جگہ مارخور کی تصویر لگانے کا نوٹس لیتے ہوئے ادارے کو مذکورہ اقدام سے عارضی طور پر روک دیا۔ میاں ثاقب نثارنے ریماکس دیئے کہ قومی پرچم کی جگہ ایک جانور کی تصویر لگائی جا رہی ہے، "
      },
      {
        "before": "کراچی (کامرس ڈیسک) آٹو انڈسٹری کی عالمی شہرت یافتہ نمائش آٹومکینیکا جرمنی میں پاکستان سے بھی 14 کمپنیوں نے \nوسیع پیمانے پر شرکت کی فرینکفرٹ میں 11 ستمبر سے 15 ستمبر تک جاری رہنے والی اس نمائش میں گاڑیوں کے پرزہ والی کمپنیوں کو بے حد اچھا رسپانس ملا ہے ٹی ڈی اے پی مذکورہ نمائش میں گزشتہ دو دہائیوں ",
        "after": "کراچی (کامرس ڈیسک) آٹو انڈسٹری کی عالمی شہرت یافتہ نمائش آٹومکینیکا جرمنی میں پاکستان سے بھی 14 کمپنیوں نے وسیع پیمانے پر شرکت کی فرینکفرٹ میں 11 ستمبر سے 15 ستمبر تک جاری رہنے والی اس نمائش میں گاڑیوں کے پرزہ والی کمپنیوں کو بے حد اچھا رسپانس ملا ہے ٹی ڈی اے پی مذکورہ نمائش میں گزشتہ دو دہائیوں سے "
      },
      {
        "before": "اپ کی ڈیوائس پر پلے بیک سپورٹ دستیاب نہیں اگر کوئی فرد یا ادارہ محتاط اور محفوظ نہیں تو منٹوں ہی میں ہیکرز انھیں لاکھوں کروڑوں کا نقصان پہنچا سکتے ہیں\n\nانٹرنیٹ اب روزمرہ انسانی زندگی کا ایک اہم جزو بن چکا ہے۔ کمپیوٹر ہو یا سمارٹ فون، اب ٹیکنالوجی کی مدد سے آپ ضروریاتِ زندگی، آسائشیں اور سہولیات گھر ",
        "after": "اپ کی ڈیوائس پر پلے بیک سپورٹ دستیاب نہیں اگر کوئی فرد یا ادارہ محتاط اور محفوظ نہیں تو منٹوں ہی میں ہیکرز انھیں لاکھوں کروڑوں کا نقصان پہنچا سکتے ہیں انٹرنیٹ اب روزمرہ انسانی زندگی کا ایک اہم جزو بن چکا ہے۔ کمپیوٹر ہو یا سمارٹ فون، اب ٹیکنالوجی کی مدد سے آپ ضروریاتِ زندگی، آسائشیں اور سہولیات گھر ب"
      },
      {
        "before": "اسلام آباد: سپریم کورٹ کے حکم پر دیامر بھاشا ڈیم اور مہمند ڈیم کے لیے جمع ہونے والے فنڈ میں اب تک بیرون ملک مقیم پاکستانیوں نے ایک ارب روپے جمع کرائے ہیں جبکہ اندرونِ ملک سے 7 ارب 47 کروڑ روپے جمع ہوچکے ہیں۔\n\nاسٹیٹ بینک آف پاکستان (ایس بی پی) کے جاری کردہ اعداد و شمار کے مطابق ڈیم فنڈ میں اب تک 8 ",
        "after": "اسلام آباد: سپریم کورٹ کے حکم پر دیامر بھاشا ڈیم اور مہمند ڈیم کے لیے جمع ہونے والے فنڈ میں اب تک بیرون ملک مقیم پاکستانیوں نے ایک ارب روپے جمع کرائے ہیں جبکہ اندرونِ ملک سے 7 ارب 47 کروڑ روپے جمع ہوچکے ہیں۔ اسٹیٹ بینک آف پاکستان (ایس بی پی) کے جاری کردہ اعداد و شمار کے مطابق ڈیم فنڈ میں اب تک 8 ارب"
      },
      {
        "before": "واشنگٹن سافٹ ویئر بنانے والی دنیا کی سب سے بڑی کمپنی مائکرو سافٹ کے شریک بانی پال ایلن انتقال کرگئے ہیں ان کی عمر 95 برس تھی ایلن کا انتقال ان کے آبائی شہر سیاٹل میں سرطان کی وجہ سے ہوا  وہ پچھلے کچھ برسو ں سے اس مرض میں مبتلاء تھے پال ایلن بل گیٹس کے بچپن کے دوست تھے پال ایلن نے ہی ہارورڈ یونیورسٹی",
        "after": "واشنگٹن سافٹ ویئر بنانے والی دنیا کی سب سے بڑی کمپنی مائکرو سافٹ کے شریک بانی پال ایلن انتقال کرگئے ہیں ان کی عمر 95 برس تھی ایلن کا انتقال ان کے آبائی شہر سیاٹل میں سرطان کی وجہ سے ہوا وہ پچھلے کچھ برسو ں سے اس مرض میں مبتلاء تھے پال ایلن بل گیٹس کے بچپن کے دوست تھے پال ایلن نے ہی ہارورڈ یونیورسٹی "
      },
      {
        "before": "کراچی (کامرس رپورٹر) سعودی عرب کی نئی اور مکمل سروسز سے آراستہ اور عبدالہادی القھتانی اینڈ سنز ہولڈنگ کمپنی کی سعودی گلف ایئر لائنز نے اپنے بین الاقوامی روٹس کے توسیع پروگرام کے تحت پاکستان کے چار شہروں کیلئے براہ راست پروازیں شروع کرنے کا اعلان کیا ہے یہ اعلان سعودی گلف ایئر لائنز نے پاکستان ٹریول",
        "after": "کراچی (کامرس رپورٹر) سعودی عرب کی نئی اور مکمل سروسز سے آراستہ اور عبدالہادی القھتانی اینڈ سنز ہولڈنگ کمپنی کی سعودی گلف ایئر لائنز نے اپنے بین الاقوامی روٹس کے توسیع پروگرام کے تحت پاکستان کے چار شہروں کیلئے براہ راست پروازیں شروع کرنے کا اعلان کیا ہے یہ اعلان سعودی گلف ایئر لائنز نے پاکستان ٹریول "
      },
      {
        "before": "تصویر کے کاپی رائٹ AFP Image caption روپے کی قدر میں کمی کا براہِ راست اثردرآمد کی جانے والی اشیاء پہ پڑتا ہے اور وہ مزید مہنگی ہوجاتی ہیں\n\nڈالرکے مقابلے میں پاکستانی روپے کی گرتی ہوئی قدر سے پاکستان کی ٹیکسٹائل اور دیگر برآمدی صنعت سے وابستہ افراد میں خوشی کی لہردوڑ گئی ہے البتہ درآمد کنندگان میں ش",
        "after": "تصویر کے کاپی رائٹ AFP Image caption روپے کی قدر میں کمی کا براہِ راست اثردرآمد کی جانے والی اشیاء پہ پڑتا ہے اور وہ مزید مہنگی ہوجاتی ہیں ڈالرکے مقابلے میں پاکستانی روپے کی گرتی ہوئی قدر سے پاکستان کی ٹیکسٹائل اور دیگر برآمدی صنعت سے وابستہ افراد میں خوشی کی لہردوڑ گئی ہے البتہ درآمد کنندگان میں شد"
      },
      {
        "before": "نئی دہلی 15 دسمبر(ایجنسی) بین الاقوامی سطح پر خام تیل کی قیمت میں گراوٹ سے ڈیزل مسلسل سستا ہو رہا ہے دہلی میں ہفتہ کے روز پٹرول کی قیمت میں 5 پیسے کا اضافہ ہوگیا جبکہ ڈیزل کی قیمت میں 7 پیسے کی کمی واقع ہوئی اس کمی کے بعد دہلی میں ہفتہ کو پٹرول 70.34 روپے فی لیٹر اور ڈیزل 64.50 روپے فی لیٹر کی سطح پ",
        "after": "نئی دہلی 15 دسمبر(ایجنسی) بین الاقوامی سطح پر خام تیل کی قیمت میں گراوٹ سے ڈیزل مسلسل سستا ہو رہا ہے دہلی میں ہفتہ کے روز پٹرول کی قیمت میں 5 پیسے کا اضافہ ہوگیا جبکہ ڈیزل کی قیمت میں 7 پیسے کی کمی واقع ہوئی اس کمی کے بعد دہلی میں ہفتہ کو پٹرول 70.34 روپے فی لیٹر اور ڈیزل 64.50 روپے فی لیٹر کی سطح پ"
      },
      {
        "before": "شیئر کریں:\n\nچین نے امریکہ کے اس الزام کہ سی پیک کی بدولت پاکستان کی معیشت بحران زدہ ہو گئی ہے مسترد کرتے ہوئے کہا ہے کہ سی پیک کا پاکستان کی شرح نمو میں رواں سال 2.5فیصد حصہ رہا،بہت سے ترقی پذیر ممالک نے چینی تعاون کا خیر مقدم کیا ہے، امریکہ چینی تعاون کو درست نظرئےے سے دیکھے، امریکہ دوست ممالک بارے",
        "after": "شیئر کریں: چین نے امریکہ کے اس الزام کہ سی پیک کی بدولت پاکستان کی معیشت بحران زدہ ہو گئی ہے مسترد کرتے ہوئے کہا ہے کہ سی پیک کا پاکستان کی شرح نمو میں رواں سال 2.5فیصد حصہ رہا،بہت سے ترقی پذیر ممالک نے چینی تعاون کا خیر مقدم کیا ہے، امریکہ چینی تعاون کو درست نظرئےے سے دیکھے، امریکہ دوست ممالک بارے "
      },
      {
        "before": "کراچی: پاکستان انٹرنیشنل ایئرلائن (پی آئی اے) کے چیف آپریشنز افسر (سی او او) ضیاء قادر قریشی کو خراب کارکردگی کے باعث ان کے عہدے سے برطرف کردیا۔\n\nذرائع کے مطابق ضیاء قریشی کو قومی ایئرلائن کے معیار کے مطابق ان کے فرائض میں کمی کے باعث 17 اگست کو ان کے عہدے سے برطرف کیا گیا تھا۔\n\nذرائع نے یہ بھی بت",
        "after": "کراچی: پاکستان انٹرنیشنل ایئرلائن (پی آئی اے) کے چیف آپریشنز افسر (سی او او) ضیاء قادر قریشی کو خراب کارکردگی کے باعث ان کے عہدے سے برطرف کردیا۔ ذرائع کے مطابق ضیاء قریشی کو قومی ایئرلائن کے معیار کے مطابق ان کے فرائض میں کمی کے باعث 17 اگست کو ان کے عہدے سے برطرف کیا گیا تھا۔ ذرائع نے یہ بھی بتایا "
      },
      {
        "before": "تصویر کے کاپی رائٹ Reuters\n\nپاکستان سٹاک مارکیٹ میں زبردست مندی کے رجحان کی وجوہات میں ماہرین پاکستان کا آیی ایم ایف کی طرف قرضے کے لیے جانا اور حکومت کی پالیسی کا واضح نہ ہونا قرار دے رہے ہیں۔\n\nپاکستان سٹاک ایکسچینج کا انڈیکس پیر کے روز 1100 پوائنٹس گرا ہے جو ایک بڑی گراوٹ سمجھی جاتی ہے۔\n\nواضح رہے ",
        "after": "تصویر کے کاپی رائٹ Reuters پاکستان سٹاک مارکیٹ میں زبردست مندی کے رجحان کی وجوہات میں ماہرین پاکستان کا آیی ایم ایف کی طرف قرضے کے لیے جانا اور حکومت کی پالیسی کا واضح نہ ہونا قرار دے رہے ہیں۔ پاکستان سٹاک ایکسچینج کا انڈیکس پیر کے روز 1100 پوائنٹس گرا ہے جو ایک بڑی گراوٹ سمجھی جاتی ہے۔ واضح رہے کہ "
      },
      {
        "before": "اسلام آباد پاکستان میں زیادہ تر بینکوں کا ڈیٹا ہیک کر لیا گیا ہے جو بیرون ملک سے ہیک کیا گیا نجی نیوز سے خصوصی گفتگو کرتے ہوئے وفاقی تحقیقاتی ایجنسی ایف آئی اے  کے ڈائریکٹر سائبر کرائمز ونگ کیپٹن (ر) شعیب نے بتایا کہ پاکستان کے زیادہ تر بینکوں کا ڈیٹا بیرون ملک سے ہیک کر لیا گیا ہے گزشتہ ہفتے ایک ",
        "after": "اسلام آباد پاکستان میں زیادہ تر بینکوں کا ڈیٹا ہیک کر لیا گیا ہے جو بیرون ملک سے ہیک کیا گیا نجی نیوز سے خصوصی گفتگو کرتے ہوئے وفاقی تحقیقاتی ایجنسی ایف آئی اے کے ڈائریکٹر سائبر کرائمز ونگ کیپٹن (ر) شعیب نے بتایا کہ پاکستان کے زیادہ تر بینکوں کا ڈیٹا بیرون ملک سے ہیک کر لیا گیا ہے گزشتہ ہفتے ایک بین"
      },
      {
        "before": "امریکی محکمہ تجارت نے اُن امریکی کمپنیوں پر سات سال کی پابندی عائد کر دی ہے جو امریکی قوانین کی خلاف ورزی کرتے ہوئے چین کی ٹیلی کام کمپنی ZTE کارپوریشن کو پرزے بیچ رہی تھیں۔\n\nخبر رساں ایجنسی رائٹر کے مطابق اس چینی کمپنی نے گزشتہ برس ٹیکساس کی امریکی فیڈرل عدالت میں یہ جرم قبول کر لیا تھا کہ اُس نے ا",
        "after": "امریکی محکمہ تجارت نے اُن امریکی کمپنیوں پر سات سال کی پابندی عائد کر دی ہے جو امریکی قوانین کی خلاف ورزی کرتے ہوئے چین کی ٹیلی کام کمپنی ZTE کارپوریشن کو پرزے بیچ رہی تھیں۔ خبر رساں ایجنسی رائٹر کے مطابق اس چینی کمپنی نے گزشتہ برس ٹیکساس کی امریکی فیڈرل عدالت میں یہ جرم قبول کر لیا تھا کہ اُس نے ای"
      },
      {
        "before": "تصویر کے کاپی رائٹ Getty Images Image caption مارکیٹ میں 115 روپے میں خریدا گیا ڈالر اب بھی دس روپے فائدہ کمانے کے بعد 125 روپے میں بک رہا ہے\n\nپاکستان میں نگران حکومت کے دور میں الیکشن کے انعقاد سے قبل امریکی ڈالر 118 روپے سے بڑھ کر 130 تک پہنچ گیا تھا لیکن الیکشن کے بعد ملک میں روپے کے مقابلے میں ڈ",
        "after": "تصویر کے کاپی رائٹ Getty Images Image caption مارکیٹ میں 115 روپے میں خریدا گیا ڈالر اب بھی دس روپے فائدہ کمانے کے بعد 125 روپے میں بک رہا ہے پاکستان میں نگران حکومت کے دور میں الیکشن کے انعقاد سے قبل امریکی ڈالر 118 روپے سے بڑھ کر 130 تک پہنچ گیا تھا لیکن الیکشن کے بعد ملک میں روپے کے مقابلے میں ڈا"
      },
      {
        "before": "2016ء اور2017ء میں کاروں کی عالمی منڈی میں جرمنی کا حصہ22فیصد تھا، جوکہ کاریں بنانے والے تمام ممالک کے مقابلے میں سب سے زیادہ تھا۔ برسوں سے دنیا میں جرمن کاروں کی مانگ میں وسعت کا سلسلہ جاری ہے۔ یہ عام تاثر ہے کہ کار خریدنے والے کو اگر مناسب قیمت میں کوئی کار دستیاب ہو اور وہ جرمن ساختہ ہو، تو وہ اس",
        "after": "2016ء اور2017ء میں کاروں کی عالمی منڈی میں جرمنی کا حصہ22فیصد تھا، جوکہ کاریں بنانے والے تمام ممالک کے مقابلے میں سب سے زیادہ تھا۔ برسوں سے دنیا میں جرمن کاروں کی مانگ میں وسعت کا سلسلہ جاری ہے۔ یہ عام تاثر ہے کہ کار خریدنے والے کو اگر مناسب قیمت میں کوئی کار دستیاب ہو اور وہ جرمن ساختہ ہو، تو وہ اس"
      },
      {
        "before": "امریکا نے روس پرایکسپورٹ سیکٹر اور سیکورٹی آلات سے متعلق پابندیاں عائد کردی ہیں روس کا کہنا ہے کہ امریکی پابندیوں کے خلاف جوابی اقدامات کریں گے امریکی محکمہ خارجہ کے سینئر عہدیدار کے مطابق روس پر پابندیوں میں الیکٹرونکس لیزر سینسرز اور آئل گیس پروڈکشن ٹیکنالوجیز کی برآمدات پر پابندی شامل ہوگی محک",
        "after": "امریکا نے روس پرایکسپورٹ سیکٹر اور سیکورٹی آلات سے متعلق پابندیاں عائد کردی ہیں روس کا کہنا ہے کہ امریکی پابندیوں کے خلاف جوابی اقدامات کریں گے امریکی محکمہ خارجہ کے سینئر عہدیدار کے مطابق روس پر پابندیوں میں الیکٹرونکس لیزر سینسرز اور آئل گیس پروڈکشن ٹیکنالوجیز کی برآمدات پر پابندی شامل ہوگی محکمہ "
      },
      {
        "before": "سیالکوٹ: وزیر اعظم کے مشیر برائے تجارت، ٹیکسٹائل، صنعتیں، پیداوار اور سرمایہ کاری عبدالرزاق داؤد نے کہا ہے کہ حکومت جلد ہی درآمدی خام مال پر تمام ڈیوٹیز اور ٹیکسز کو ختم کردے گی۔\n\nڈان اخبار کی رپورٹ کے مطابق عبدالرزاق داؤد نے سیالکوٹ میں ایوان صنعت و تجارت کا دورہ کیا اور سیالکوٹ کے برآمد کنندگان ",
        "after": "سیالکوٹ: وزیر اعظم کے مشیر برائے تجارت، ٹیکسٹائل، صنعتیں، پیداوار اور سرمایہ کاری عبدالرزاق داؤد نے کہا ہے کہ حکومت جلد ہی درآمدی خام مال پر تمام ڈیوٹیز اور ٹیکسز کو ختم کردے گی۔ ڈان اخبار کی رپورٹ کے مطابق عبدالرزاق داؤد نے سیالکوٹ میں ایوان صنعت و تجارت کا دورہ کیا اور سیالکوٹ کے برآمد کنندگان کے "
      },
      {
        "before": "تصویر کے کاپی رائٹ AFP/Getty Images\n\nعالمی مالیاتی ادارے (آئی ایم ایف) نے امریکی صدر ڈونلڈ ٹرمپ کی جانب سے سٹیل اور ایلومنیم کی درآمد پر 10 سے 25 فیصد ڈیوٹی عائد کرنے کے مجوزہ اقدام پر سخت تنقید کی ہے۔\n\nڈونلڈ ٹرمپ نے سٹیل کی درآمد پر 25 فیصد اور ایلومینم کی درآمد پر 10 فیصد ڈیوٹی لگانے کے منصوبے کا ",
        "after": "تصویر کے کاپی رائٹ AFP/Getty Images عالمی مالیاتی ادارے (آئی ایم ایف) نے امریکی صدر ڈونلڈ ٹرمپ کی جانب سے سٹیل اور ایلومنیم کی درآمد پر 10 سے 25 فیصد ڈیوٹی عائد کرنے کے مجوزہ اقدام پر سخت تنقید کی ہے۔ ڈونلڈ ٹرمپ نے سٹیل کی درآمد پر 25 فیصد اور ایلومینم کی درآمد پر 10 فیصد ڈیوٹی لگانے کے منصوبے کا اع"
      },
      {
        "before": "اسلام آباد ٹریڈ ڈیولپمنٹ اتھارٹی آف پاکستان ٹی ڈی اے پی اور جاپان انٹرنیشنل کو آپریٹو ایجینسی جائیکا کے باہمی اشتراک سے ٹوکیو جاپان میں کھیلوں کے سامان کی 3 روزہ نمائش سپورٹک کا انعقاد کیا جائے گا جاپان انٹرنیشنل کو آپریٹو ایجینسی جائیکا کے بیان کے مطابق نمائش کا آغاز 25 جولائی 2018 کو ہو گا جو",
        "after": "اسلام آباد ٹریڈ ڈیولپمنٹ اتھارٹی آف پاکستان ٹی ڈی اے پی اور جاپان انٹرنیشنل کو آپریٹو ایجینسی جائیکا کے باہمی اشتراک سے ٹوکیو جاپان میں کھیلوں کے سامان کی 3 روزہ نمائش سپورٹک کا انعقاد کیا جائے گا جاپان انٹرنیشنل کو آپریٹو ایجینسی جائیکا کے بیان کے مطابق نمائش کا آغاز 25 جولائی 2018 کو ہو گا جو 27 ج"
      },
      {
        "before": "شاندار خوشخبری 2 بڑی کمپنیوں نے پاکستان میں 1.4 ارب ڈالر کی سرمایہ کاری کا اعلان کردیا \nاسلام آباد (مانیٹرنگ ڈیسک) پیپسی اور کوکا کولا دنیا کی بڑی کمپنیوں میں سے دو ہیں جن کے مشروبات باقی دنیا کے ساتھ ساتھ پاکستان میں بھی بے حد مقبول ہیں اب ان دونوں کمپنیوں نے پاکستان میں 1.4 ارب ڈالر کی سرمایہ کاری",
        "after": "شاندار خوشخبری 2 بڑی کمپنیوں نے پاکستان میں 1.4 ارب ڈالر کی سرمایہ کاری کا اعلان کردیا اسلام آباد (مانیٹرنگ ڈیسک) پیپسی اور کوکا کولا دنیا کی بڑی کمپنیوں میں سے دو ہیں جن کے مشروبات باقی دنیا کے ساتھ ساتھ پاکستان میں بھی بے حد مقبول ہیں اب ان دونوں کمپنیوں نے پاکستان میں 1.4 ارب ڈالر کی سرمایہ کاری "
      },
      {
        "before": "تصویر کے کاپی رائٹ Getty Images\n\nبرطانیہ میں گھریلو سامان کے سٹوروں کی چین ہوم بیس اس وقت صرف ایک پاؤنڈ میں بک گئی جب اس کے آسٹریلوی مالک ویس فارمرز نے برطانیہ میں ناکامی کے بعد وہاں اپنا تمام کاروبار فروخت کرنے کا فیصلہ کر لیا۔\n\nویس فارمرز نے صرف دو سال پہلے ہوم بیس 34 کروڑ پاؤنڈ میں خریدی تھی، لیک",
        "after": "تصویر کے کاپی رائٹ Getty Images برطانیہ میں گھریلو سامان کے سٹوروں کی چین ہوم بیس اس وقت صرف ایک پاؤنڈ میں بک گئی جب اس کے آسٹریلوی مالک ویس فارمرز نے برطانیہ میں ناکامی کے بعد وہاں اپنا تمام کاروبار فروخت کرنے کا فیصلہ کر لیا۔ ویس فارمرز نے صرف دو سال پہلے ہوم بیس 34 کروڑ پاؤنڈ میں خریدی تھی، لیکن "
      },
      {
        "before": "کراچی پاکستان کی تاریخ میں پہلی بار کراچی میں پاکستان انٹرنیشنل بلک ٹرمینلز لمیٹڈ نے پیٹرولیم کوک اور کوئلے کی کارگو ہینڈلنگ کی ہے جو اس نوعیت کی پہلی ہینڈلنگ ہے پی آئی بی ٹی کے بیان کے مطابق ایم وی زونگ یو 89 جہاز پورٹ قاسم پر 10 دسمبر شام 4 بجے پہنچا تھا جو پی آئی بی ٹی پر اپنی نوعیت کے اعتبار س",
        "after": "کراچی پاکستان کی تاریخ میں پہلی بار کراچی میں پاکستان انٹرنیشنل بلک ٹرمینلز لمیٹڈ نے پیٹرولیم کوک اور کوئلے کی کارگو ہینڈلنگ کی ہے جو اس نوعیت کی پہلی ہینڈلنگ ہے پی آئی بی ٹی کے بیان کے مطابق ایم وی زونگ یو 89 جہاز پورٹ قاسم پر 10 دسمبر شام 4 بجے پہنچا تھا جو پی آئی بی ٹی پر اپنی نوعیت کے اعتبار سے "
      },
      {
        "before": "سیئول (اُردو پوائنٹ اخبارتازہ ترین 18 دسمبر2018ء) جنوبی کوریا میں اوسط عمر کے افراد کی 55.2 فیصد آبادی نجی قرضوں کا شکار ہے جو انھوں نے بینکوں اور دیگر ذرائع سے حاصل کر رکھے ہیں قومی ادارہ برائے اعداد و شمار کی منگل کو جاری ہونے والی رپورٹ کے مطابق ملک کے 40 سے 64 سال کی عمر تک کے افراد کی اکثریت (",
        "after": "سیئول (اُردو پوائنٹ اخبارتازہ ترین 18 دسمبر2018ء) جنوبی کوریا میں اوسط عمر کے افراد کی 55.2 فیصد آبادی نجی قرضوں کا شکار ہے جو انھوں نے بینکوں اور دیگر ذرائع سے حاصل کر رکھے ہیں قومی ادارہ برائے اعداد و شمار کی منگل کو جاری ہونے والی رپورٹ کے مطابق ملک کے 40 سے 64 سال کی عمر تک کے افراد کی اکثریت (5"
      },
      {
        "before": "تصویر کے کاپی رائٹ EPA Image caption گذشتہ دنوں ملک بھر میں پیٹرول کی قیمت میں اضافے پر علامتی ہڑتال کا اعلان ہوا تھا جس میں بعض مقامات پر وزیر اعظم نریندر مودی کی تصاویر نذر آتش کی گئیں\n\nانڈیا میں کچھ باتیں ایسی ہو رہی ہیں جو پہلے کبھی نہیں ہوئیں، اور سبھی وزیراعظم نریندر مودی کے لیے بری خبریں ہیں۔",
        "after": "تصویر کے کاپی رائٹ EPA Image caption گذشتہ دنوں ملک بھر میں پیٹرول کی قیمت میں اضافے پر علامتی ہڑتال کا اعلان ہوا تھا جس میں بعض مقامات پر وزیر اعظم نریندر مودی کی تصاویر نذر آتش کی گئیں انڈیا میں کچھ باتیں ایسی ہو رہی ہیں جو پہلے کبھی نہیں ہوئیں، اور سبھی وزیراعظم نریندر مودی کے لیے بری خبریں ہیں۔ "
      },
      {
        "before": "امریکا کی وزرات خزانہ نے مشکوک زرِ مبادلہ کی پالیسی پر بھارت کو کرنسی واچ لسٹ میں شامل کردیا اس فہرست میں بھارت اور چین کے علاوہ دیگر ممالک بھی شامل ہیں امریکی وزارت خزانہ کی جاری رپورٹ کے مطابق واچ لسٹ میں ان تمام بڑے کاروباری شراکت داروں کو شامل کیا گیا ہے جن کی کرنسی پالیسی توجہ طلب ہے اس ششماہی ",
        "after": "امریکا کی وزرات خزانہ نے مشکوک زرِ مبادلہ کی پالیسی پر بھارت کو کرنسی واچ لسٹ میں شامل کردیا اس فہرست میں بھارت اور چین کے علاوہ دیگر ممالک بھی شامل ہیں امریکی وزارت خزانہ کی جاری رپورٹ کے مطابق واچ لسٹ میں ان تمام بڑے کاروباری شراکت داروں کو شامل کیا گیا ہے جن کی کرنسی پالیسی توجہ طلب ہے اس ششماہی "
      },
      {
        "before": "پاکستان کے صوبہ بلوچستان کے ماحولیات کے تحفظ کے ادارے ’انوائرنمنٹ پروٹیکشن ایجنسی‘ نے اپنی حتمی رپورٹ میں کہا ہے کہ بلوچستان اور سندھ کے ساحلی علاقوں کو آلودہ کرنے والا تیل سمندری حدود سے گزرنے والے کسی بحری جہاز سے نکلا تھا۔\n\nنیشنل انسٹیٹیوٹ آف اوشان گرافی نے بھی بائیکو کے نمونے حاصل کیے ہیں اور ان",
        "after": "پاکستان کے صوبہ بلوچستان کے ماحولیات کے تحفظ کے ادارے ’انوائرنمنٹ پروٹیکشن ایجنسی‘ نے اپنی حتمی رپورٹ میں کہا ہے کہ بلوچستان اور سندھ کے ساحلی علاقوں کو آلودہ کرنے والا تیل سمندری حدود سے گزرنے والے کسی بحری جہاز سے نکلا تھا۔ نیشنل انسٹیٹیوٹ آف اوشان گرافی نے بھی بائیکو کے نمونے حاصل کیے ہیں اور ان "
      },
      {
        "before": "واشنگٹن (آن لائن) ٹرمپ انتظامیہ نے پاکستان کے روکے گئے سیکیورٹی فنڈز بحال کرنے پر غور شروع کردیا امریکی اخبار نے دعویٰ کیا ہے کہ ٹرمپ انتظامیہ پاکستان کی نئی حکومت کے ساتھ تعلقات معمول پر لانے کی خواہاں ہے اور اس سلسلے میں اس نے پاکستان کے روکے گئے فنڈز دوبارہ بحال کرنے پر بھی غور شروع کیا ہے اخبار",
        "after": "واشنگٹن (آن لائن) ٹرمپ انتظامیہ نے پاکستان کے روکے گئے سیکیورٹی فنڈز بحال کرنے پر غور شروع کردیا امریکی اخبار نے دعویٰ کیا ہے کہ ٹرمپ انتظامیہ پاکستان کی نئی حکومت کے ساتھ تعلقات معمول پر لانے کی خواہاں ہے اور اس سلسلے میں اس نے پاکستان کے روکے گئے فنڈز دوبارہ بحال کرنے پر بھی غور شروع کیا ہے اخبار "
      },
      {
        "before": "تصویر کے کاپی رائٹ Getty Images Image caption پاکستان اپنے کرنسی کے بحران سے نکلنے کی جدوجہد میں ہے جو کہ نئی حکومت کے لیے سب سے بڑا چیلنج ہے اور آئی ایم ایف کے بیل آؤٹ کے علاوہ کوئی اور آپشن مشکل نظر آتا ہے\n\nامریکی وزیر خارجہ مائک پومپيو نے پیر کو بین الاقوامی مالیاتی ادارے آئی ایم ایف کی جانب سے پ",
        "after": "تصویر کے کاپی رائٹ Getty Images Image caption پاکستان اپنے کرنسی کے بحران سے نکلنے کی جدوجہد میں ہے جو کہ نئی حکومت کے لیے سب سے بڑا چیلنج ہے اور آئی ایم ایف کے بیل آؤٹ کے علاوہ کوئی اور آپشن مشکل نظر آتا ہے امریکی وزیر خارجہ مائک پومپیو نے پیر کو بین الاقوامی مالیاتی ادارے آئی ایم ایف کی جانب سے پا"
      },
      {
        "before": "کراچی (کامرس رپورٹر) اوریکل نے مالی سال 2019 کی پہلی سہ ماہی کا اعلان کردیا ہے جس کے مطابق اوریکل سی ای او سافرا کیٹس نے کہا کہ پہلی سہ ماہی میں شاندار نتائج سامنے آئے ہیں مستحکم فی حصص آمدن کی شرح سے اعتماد میں اضافہ ہوا ہے اور ہم ایسے ہی نتائج کی آئندہ بھی توقعات رکھتے ہیں اوریکل فیوژن کلائوڈ ا",
        "after": "کراچی (کامرس رپورٹر) اوریکل نے مالی سال 2019 کی پہلی سہ ماہی کا اعلان کردیا ہے جس کے مطابق اوریکل سی ای او سافرا کیٹس نے کہا کہ پہلی سہ ماہی میں شاندار نتائج سامنے آئے ہیں مستحکم فی حصص آمدن کی شرح سے اعتماد میں اضافہ ہوا ہے اور ہم ایسے ہی نتائج کی آئندہ بھی توقعات رکھتے ہیں اوریکل فیوژن کلائوڈ ای آ"
      },
      {
        "before": "تصویر کے کاپی رائٹ AFP Image caption جنگ گروپ کا موقف معلوم کرنے کے لیے بارہا رابطہ کی کوشش کی گئی لیکن انہوں نے بات کرنے سے انکار کردیا۔ (فائل فوٹو)\n\nپاکستان میں میڈیا کا سب سے بڑا ادارہ سمجھے جانے والے جنگ گروپ نے مبینہ ’مالی بحران‘ کے باعث پشاور، کراچی اور لاہور سے شائع ہونے والے پانچ اخبارات اور",
        "after": "تصویر کے کاپی رائٹ AFP Image caption جنگ گروپ کا موقف معلوم کرنے کے لیے بارہا رابطہ کی کوشش کی گئی لیکن انہوں نے بات کرنے سے انکار کردیا۔ (فائل فوٹو) پاکستان میں میڈیا کا سب سے بڑا ادارہ سمجھے جانے والے جنگ گروپ نے مبینہ ’مالی بحران‘ کے باعث پشاور، کراچی اور لاہور سے شائع ہونے والے پانچ اخبارات اور "
      },
      {
        "before": "کراچی (اُردو پوائنٹ اخبارتازہ ترین 05 دسمبر2018ء) سستی ایل این جی اور مقامی آئل ریفائنریزکو نظراندازکرتے پاور پلانٹس کے لیے بڑے پیمانے پر فرنس آئل درآمد میں پاورسیکٹر انٹرنیشنل فرنس آئل سپلائرز اور پاکستان سٹیٹ آئل پی ایس او کی اعلی انتظامیہ کی ملی بھگت سامنے آئی ہے اعلی حکام اس بات پر حیران ہ",
        "after": "کراچی (اُردو پوائنٹ اخبارتازہ ترین 05 دسمبر2018ء) سستی ایل این جی اور مقامی آئل ریفائنریزکو نظراندازکرتے پاور پلانٹس کے لیے بڑے پیمانے پر فرنس آئل درآمد میں پاورسیکٹر انٹرنیشنل فرنس آئل سپلائرز اور پاکستان سٹیٹ آئل پی ایس او کی اعلی انتظامیہ کی ملی بھگت سامنے آئی ہے اعلی حکام اس بات پر حیران ہیں کہ "
      },
      {
        "before": "تصویر کے کاپی رائٹ Getty Images Image caption پاکستان کی ٹیکسٹائل کی صنعت بھی بجلی کے بحران کی وجہ سے بری طرح متاثر ہوئی ہے\n\nامریکی وزارتِ خارجہ کی ترجمان نے کہا ہے کہ پاکستان کی موجودہ اقتصادی حالت کی ذمہ داری ایک حوالے سے چین سے لیے ہوئے قرضوں پر بھی ہے۔\n\nانھوں نے جمعرات کو اپنی ایک پریس بریفنگ می",
        "after": "تصویر کے کاپی رائٹ Getty Images Image caption پاکستان کی ٹیکسٹائل کی صنعت بھی بجلی کے بحران کی وجہ سے بری طرح متاثر ہوئی ہے امریکی وزارتِ خارجہ کی ترجمان نے کہا ہے کہ پاکستان کی موجودہ اقتصادی حالت کی ذمہ داری ایک حوالے سے چین سے لیے ہوئے قرضوں پر بھی ہے۔ انھوں نے جمعرات کو اپنی ایک پریس بریفنگ میں "
      },
      {
        "before": "لاہور ( کامرس رپورٹر ) ناموافق اور سخت حالات سمیت مسابقتی دباؤ کے باوجود نیسلے پاکستان کی آمدنی میں 30 ستمبر 2018ء کے نو ماہ کے عرصے میں 1.8 فیصد اضافہ کمپنی کی مجموعی آمدنی 1.7 بلین روپے سے بڑھ گئی اور 1.94  بلین روپے تک جاپہنچی مذکورہ مالیاتی نتائج کا اعلان 23 اکتوبر 2018ء کو نیسلے پاکستان کے ب",
        "after": "لاہور ( کامرس رپورٹر ) ناموافق اور سخت حالات سمیت مسابقتی دباؤ کے باوجود نیسلے پاکستان کی آمدنی میں 30 ستمبر 2018ء کے نو ماہ کے عرصے میں 1.8 فیصد اضافہ کمپنی کی مجموعی آمدنی 1.7 بلین روپے سے بڑھ گئی اور 1.94 بلین روپے تک جاپہنچی مذکورہ مالیاتی نتائج کا اعلان 23 اکتوبر 2018ء کو نیسلے پاکستان کے بورڈ "
      },
      {
        "before": "سعودی عرب نے ایک ارب ڈالر پاکستان کو منتقل کردیئے اس منتقلی سے سٹیٹ بنک کے زرمبادلہ کے ذکائر 8 ارب     \n 26 کروڑ ڈالر ہوگئے وزارت خزانہ کے مطابق سعودی عرب نے ایک ارب ڈالر پاکستان کو منتقل کردیئے سعودی پیکج کے تحت یہ دوسری قسط پاکستان کو موصول ہوئی ہے ایک ارب ڈالر کی تیسری قسط جنوری کے وسط میں پاکستا",
        "after": "سعودی عرب نے ایک ارب ڈالر پاکستان کو منتقل کردیئے اس منتقلی سے سٹیٹ بنک کے زرمبادلہ کے ذکائر 8 ارب 26 کروڑ ڈالر ہوگئے وزارت خزانہ کے مطابق سعودی عرب نے ایک ارب ڈالر پاکستان کو منتقل کردیئے سعودی پیکج کے تحت یہ دوسری قسط پاکستان کو موصول ہوئی ہے ایک ارب ڈالر کی تیسری قسط جنوری کے وسط میں پاکستان کو م"
      },
      {
        "before": "امریکی صدر ڈونلڈ ٹرمپ نے آج جمعہ کے روز چین سے ہونے والی درآمدات پر 50 ارب ڈالر کے محصولات عائد کرنے کا اعلان کر دیا ہے جبکہ چین نے اس کا فوری جواب دیتے ہوئے امریکی درآمدات پر بھی 50 ارب ڈالر کے ہی محصولات عائد کر دئے ہیں۔ یوں دنیا کی دو سب سے بڑی معیشتوں کے درمیان باضابطہ طور پر طبل جنگ بجا دیا ",
        "after": "امریکی صدر ڈونلڈ ٹرمپ نے آج جمعہ کے روز چین سے ہونے والی درآمدات پر 50 ارب ڈالر کے محصولات عائد کرنے کا اعلان کر دیا ہے جبکہ چین نے اس کا فوری جواب دیتے ہوئے امریکی درآمدات پر بھی 50 ارب ڈالر کے ہی محصولات عائد کر دئے ہیں۔ یوں دنیا کی دو سب سے بڑی معیشتوں کے درمیان باضابطہ طور پر طبل جنگ بجا دیا گیا"
      },
      {
        "before": "تصویر کے کاپی رائٹ Mecca\n\nبہت سی خواتین کے لیے کسی ڈپارٹمنٹ سٹور سے میک اپ کا سامان خریدنا ایک مشکل تجربہ ہوتا ہے، اور جو ہورگن ان خواتین سے الگ نہیں ہیں۔\n\n49 سالہ جو ہارگن کا کہنا ہے کہ ان کے لیے اکثر بڑا مشکل ہو جاتا ہے جب مختلف برانڈز کے اپنے اپنے الگ کاؤنٹرز یا رعایت ہوتی ہے جن کے لیے وہاں چند خ",
        "after": "تصویر کے کاپی رائٹ Mecca بہت سی خواتین کے لیے کسی ڈپارٹمنٹ سٹور سے میک اپ کا سامان خریدنا ایک مشکل تجربہ ہوتا ہے، اور جو ہورگن ان خواتین سے الگ نہیں ہیں۔ 49 سالہ جو ہارگن کا کہنا ہے کہ ان کے لیے اکثر بڑا مشکل ہو جاتا ہے جب مختلف برانڈز کے اپنے اپنے الگ کاؤنٹرز یا رعایت ہوتی ہے جن کے لیے وہاں چند خوا"
      },
      {
        "before": "حکومت کے ایک فیصلے سے پاکستان کے 12ارب روپے ضائع ہوگئے اسلام آباد (ڈیلی پاکستان آن لائن) پاکستان ایل این جی لمیٹڈ نے انتہائی ضروری ایل این جی شپمنٹ منسوخ کردی جس کی وجہ سے نہ صرف سردیوں میں گیس کی قلت ہوگی بلکہ خزانے سے 12ارب روپے کا ضیاع بھی ہوگا فرنس آئل مافیا کو بھی اپنے پنجے گاڑھنے کا موقع مل جا",
        "after": "حکومت کے ایک فیصلے سے پاکستان کے 12ارب روپے ضائع ہوگئے اسلام آباد (ڈیلی پاکستان آن لائن) پاکستان ایل این جی لمیٹڈ نے انتہائی ضروری ایل این جی شپمنٹ منسوخ کردی جس کی وجہ سے نہ صرف سردیوں میں گیس کی قلت ہوگی بلکہ خزانے سے 12ارب روپے کا ضیاع بھی ہوگا فرنس آئل مافیا کو بھی اپنے پنجے گاڑھنے کا موقع مل جا"
      },
      {
        "before": "تصویر کے کاپی رائٹ Getty Images Image caption پاکستانی روپے کی قدر میں کمی ہو رہی ہے\n\nانتخابات سے پہلے پاکستان شدید معاشی بحران کی سمت جاتا نظرآ رہا ہے۔\n\nپاکستانی کرنسی کی قدر میں کمی رکنے کا نام ہی نہیں لے رہی۔ جمعرات کے روز ایک امریکی ڈالر کی قیمت 118 پاکستانی روپے سات پیسے تھی۔\n\nاگر ڈالر کی کسوٹی",
        "after": "تصویر کے کاپی رائٹ Getty Images Image caption پاکستانی روپے کی قدر میں کمی ہو رہی ہے انتخابات سے پہلے پاکستان شدید معاشی بحران کی سمت جاتا نظرآ رہا ہے۔ پاکستانی کرنسی کی قدر میں کمی رکنے کا نام ہی نہیں لے رہی۔ جمعرات کے روز ایک امریکی ڈالر کی قیمت 118 پاکستانی روپے سات پیسے تھی۔ اگر ڈالر کی کسوٹی پر"
      },
      {
        "before": "اسلام آباد: مالیاتی درجہ بندی دینے والے 3 بڑے اداروں میں سے ایک’ فِچ ریٹنگز‘ نے پاکستان کی قرض لینے کی درجہ بندی کو زرِ مبادلہ کے کم ذخائر، خراب مالی صورتحال اور انتہائی بھاری واجب الادا رقم کے باعث کم کر کے ’بی نیگیٹو‘ کردیا۔\n\nڈان اخبار کی رپورٹ کے مطابق نیو یارک سے تعلق رکھنے والی ریٹنگ ایجنسی کا",
        "after": "اسلام آباد: مالیاتی درجہ بندی دینے والے 3 بڑے اداروں میں سے ایک’ فِچ ریٹنگز‘ نے پاکستان کی قرض لینے کی درجہ بندی کو زرِ مبادلہ کے کم ذخائر، خراب مالی صورتحال اور انتہائی بھاری واجب الادا رقم کے باعث کم کر کے ’بی نیگیٹو‘ کردیا۔ ڈان اخبار کی رپورٹ کے مطابق نیو یارک سے تعلق رکھنے والی ریٹنگ ایجنسی کا ک"
      },
      {
        "before": "Image caption گھریلو خاتون صائمہ گھرکا بنا صاف ستھرا کھانا کمرشل بنیادوں پر فراہم کرتی ہیں\n\nپاکستان کے صوبہ خیبر پختون خوا کے دارالحکومت پشاور میں کچھ خواتین نے گھر کی مالی مشکلات پر قابو پانے کے لیے اپنے کچن میں ہی اپنا کاروبار شروع کردیا ہے اور اس کے لیے سوشل میڈیا خاص طور پر فیس بک کا استعمال کیا",
        "after": "Image caption گھریلو خاتون صائمہ گھرکا بنا صاف ستھرا کھانا کمرشل بنیادوں پر فراہم کرتی ہیں پاکستان کے صوبہ خیبر پختون خوا کے دارالحکومت پشاور میں کچھ خواتین نے گھر کی مالی مشکلات پر قابو پانے کے لیے اپنے کچن میں ہی اپنا کاروبار شروع کردیا ہے اور اس کے لیے سوشل میڈیا خاص طور پر فیس بک کا استعمال کیا "
      },
      {
        "before": "اسلام آباد(اُردو پوائنٹ اخبارتازہ ترین۔ 11 دسمبر2018ء) چیک جمہوریہ کی ایک بجلی پیدا کرنے والی کمپنی اور جی ای(NYSE: GE) نے اعلان کیا ہے کہ یورپ کا پہلا جی ای 9EMax گیس ٹربائن اپ گریڈ کامیابی سے مکمل ہو گیا ہے جی ای کی کمبائنڈ سائکل صلاحیتیں اور9EMaxکی کارکردگی ہیٹ ریٹ، پاور آئوٹ پٹ اور یونٹflexibi",
        "after": "اسلام آباد(اُردو پوائنٹ اخبارتازہ ترین۔ 11 دسمبر2018ء) چیک جمہوریہ کی ایک بجلی پیدا کرنے والی کمپنی اور جی ای(NYSE: GE) نے اعلان کیا ہے کہ یورپ کا پہلا جی ای 9EMax گیس ٹربائن اپ گریڈ کامیابی سے مکمل ہو گیا ہے جی ای کی کمبائنڈ سائکل صلاحیتیں اور9EMaxکی کارکردگی ہیٹ ریٹ، پاور آئوٹ پٹ اور یونٹflexibilt"
      },
      {
        "before": "بین الاقوامی مالیاتی فنڈ (آئی ایم ایف) نے پاکستان کی اقتصادی صورتحال پر اپنی رپورٹ جاری کر دی ہے جس کے مطابق پاکستان کے زرمبادلہ کے ذخائر کم ہو کر 12.8 ارب ڈالر رہ گئے ہیں آئی ایم ایف کے اندازوں کے مطابق ان زرمبادلہ کے ذخائر سے صرف تین ماہ سے بھی کم عرصے تک کے لیے درآمدات کی ادائیگی ممکن ہوگی دوسری ",
        "after": "بین الاقوامی مالیاتی فنڈ (آئی ایم ایف) نے پاکستان کی اقتصادی صورتحال پر اپنی رپورٹ جاری کر دی ہے جس کے مطابق پاکستان کے زرمبادلہ کے ذخائر کم ہو کر 12.8 ارب ڈالر رہ گئے ہیں آئی ایم ایف کے اندازوں کے مطابق ان زرمبادلہ کے ذخائر سے صرف تین ماہ سے بھی کم عرصے تک کے لیے درآمدات کی ادائیگی ممکن ہوگی دوسری "
      },
      {
        "before": "تہران (این این آئی) بین الاقوامی مالیاتی مواصلات ایسوسی ایشن یعنی سوفٹ نظام ایران کے خلاف امریکی پابندیوں کے نفاذ  سوفٹ میں اپنی جانب سے عملی اقدامات کا آغاز کردیا ہے کی طرف سے ایرانی بنکوں پر پابندیاں عاید کی جا رہی ہیں اور ایرانی بنکوں کو ترسیلات زر پر پابندی لگانے کا عمل شروع کردیا گیا ہے سوفٹ کے",
        "after": "تہران (این این آئی) بین الاقوامی مالیاتی مواصلات ایسوسی ایشن یعنی سوفٹ نظام ایران کے خلاف امریکی پابندیوں کے نفاذ سوفٹ میں اپنی جانب سے عملی اقدامات کا آغاز کردیا ہے کی طرف سے ایرانی بنکوں پر پابندیاں عاید کی جا رہی ہیں اور ایرانی بنکوں کو ترسیلات زر پر پابندی لگانے کا عمل شروع کردیا گیا ہے سوفٹ کے "
      },
      {
        "before": "تصویر کے کاپی رائٹ AFP\n\nٹیکنالوجی اور سافٹ وئیر بنانے والی کمپنی مائیکروسافٹ کے بانی بل گیٹس کا شمار بھی ان بڑھتے ہوئے ٹیکنالوجی کے منتظمین میں شامل ہو گیا ہے جو کرپٹو کرنسی کی مخالفت کرتے ہیں۔\n\nانٹرنیٹ کی ویب سائٹ ریڈ اِٹ سے بات کرتے ہوئے بل گیٹس نے کہا کہ 'کرپٹو کرنسی خطرناک ہے اور موت کا سبب بنتی",
        "after": "تصویر کے کاپی رائٹ AFP ٹیکنالوجی اور سافٹ وئیر بنانے والی کمپنی مائیکروسافٹ کے بانی بل گیٹس کا شمار بھی ان بڑھتے ہوئے ٹیکنالوجی کے منتظمین میں شامل ہو گیا ہے جو کرپٹو کرنسی کی مخالفت کرتے ہیں۔ انٹرنیٹ کی ویب سائٹ ریڈ اِٹ سے بات کرتے ہوئے بل گیٹس نے کہا کہ 'کرپٹو کرنسی خطرناک ہے اور موت کا سبب بنتی ہ"
      },
      {
        "before": "تصویر کے کاپی رائٹ Getty Images\n\nپاکستان تحریک انصاف کی حکومت نے کئی روز کی ہچکچاہٹ اور سوچ بچار کے بعد بالآخر قرض کے حصول کے لیے عالمی مالیاتی ادارے، آئی ایم ایف سے رجوع کرنے کا فیصلہ کیا ہے۔\n\nکئی سیاسی تجزیہ کار اس فیصلے پر حکومت کے لتے لے رہے ہیں اور بہت سے معاشی ماہرین اس فیصلے کو درست قرار دے ر",
        "after": "تصویر کے کاپی رائٹ Getty Images پاکستان تحریک انصاف کی حکومت نے کئی روز کی ہچکچاہٹ اور سوچ بچار کے بعد بالآخر قرض کے حصول کے لیے عالمی مالیاتی ادارے، آئی ایم ایف سے رجوع کرنے کا فیصلہ کیا ہے۔ کئی سیاسی تجزیہ کار اس فیصلے پر حکومت کے لتے لے رہے ہیں اور بہت سے معاشی ماہرین اس فیصلے کو درست قرار دے رہے"
      }
    ]
  }
}